---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterStringLess
source: html/8fb117a0-7ef7-9504-648a-1161b054e1eb.htm
---
# FilterStringLess Methods

Derived classes override this method to implement the test that determines
 whether the two given string values satisfy the desired condition or not.